bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21G18A.PIC
      <edc:SFRDef edc:access="--------nnnnnnnn--------nnnnnnnn" edc:addr="0x42001424" edc:cname="ADDR" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address Value" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:desc="Address Mask" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------nnnnnnnnn" edc:addr="0x42001428" edc:cname="DATA" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4200140C" edc:cname="BAUD" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="BAUD" edc:desc="Baud Rate Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0x42001430" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:desc="Debug Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n---nnnn" edc:addr="0x42001414" edc:cname="INTENCLR" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSL" edc:desc="Slave Select Low Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n---nnnn" edc:addr="0x42001416" edc:cname="INTENSET" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSL" edc:desc="Slave Select Low Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n---nnnn" edc:addr="0x42001418" edc:cname="INTFLAG" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSL" edc:desc="Slave Select Low Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------n--" edc:addr="0x4200141A" edc:cname="STATUS" edc:impl="0x4" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:desc="Buffer Overflow" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------------rrr" edc:addr="0x4200141C" edc:cname="SYNCBUSY" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM4">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SERCOM Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="CTRLB Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:EmulatorSector edc:beginaddr="0xE0001000" edc:endaddr="0xE0003000" edc:regionid="emulation"/>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA00" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="CMP2" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XIN32" edc:ppsfunction="XIN32"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA01" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="CMP3" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XOUT32" edc:ppsfunction="XOUT32"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA02" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="VOUT" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y0" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA03" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="VREFP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="VREFP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="VREFREADY1" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB08" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y14" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="INN1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IN8" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB09" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="INP1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="OUT2" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA04" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="VREFP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BGBUFRRREADY" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA05" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="VREF_ANA_OUT" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA06" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="INN0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BIAS_TEST_OUT" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA07" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="INP0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BGBUFREADY5" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA08" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y16" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BGBUFREADY0" edc:ppsfunction="VREG"/>
      <edc:VirtualPin edc:name="XOSC_EN" edc:ppsfunction="XOSC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA09" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y17" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IN4" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BGBUFREADY1" edc:ppsfunction="VREG"/>
      <edc:VirtualPin edc:name="XOSC_CLK" edc:ppsfunction="XOSC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y18" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BGBUFREADY2" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y19" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BGBUFREADY3" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="TX" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="RX" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="BIASREADY" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="BGBUFREADY4" edc:ppsfunction="VREG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="XIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="EXTWAKE15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="XOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y20" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y21" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y22" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X7" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y23" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="I"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y24" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y25" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y26" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN6" edc:ppsfunction="I"/>
    </edc:Pin>
